Дипломный_проект/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломный_проект/src/Documents/РеализацияТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// {{ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 09.01.2024 ++
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Заказ покупателя
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Печать акта";
	КомандаПечати.Представление = НСтр("ru = 'Печать акта'");
	КомандаПечати.Порядок = 5;
		
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Печать акта");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьАкта(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Реализация товаров,услуг'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЗаказПокупателя.ПФ_MXL_ПечатьАкта";
	КонецЕсли;
	
КонецПроцедуры
 // }}ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 09.01.2024 --
 
#КонецОбласти

 #Область ССлужебныеПроцедурыФункции
 
 // {{ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 09.01.2024 ++
 Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПараметрыПечати_ПечатьАкта";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_ПечатьАкта");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация.Представление КАК ОрганизацияПредставление,
	|	РеализацияТоваровУслуг.Контрагент.Представление КАК КонтрагентПредставление,
	|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслуг.Договор) КАК Договор,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслуг.Услуги.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура.Представление КАК НоменклатураПредставление,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();	
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если НЕ ВставлятьРазделительСтраниц Тогда
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;   
		
	//Вывод области заголовка шапки макета
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокШапки");            
	ОбластьЗаголовок.Параметры.Дата        = Формат(Выборка.Дата, "ДЛФ=DD");
	ОбластьЗаголовок.Параметры.Номер       = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);
	ОбластьЗаголовок.Параметры.Организация = Выборка.ОрганизацияПредставление;
	ОбластьЗаголовок.Параметры.Контрагент  = Выборка.КонтрагентПредставление;
	ОбластьЗаголовок.Параметры.Договор     = Выборка.Договор;
	ТабДок.Вывести(ОбластьЗаголовок);
		
	//Вывод  шапки таблицы Услуги
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(ОбластьУслугиШапка);
		
	//Вывод  строк таблицы Услуги
	ВыборкаУслуги = Выборка.Услуги.Выбрать();
	Пока ВыборкаУслуги.Следующий() Цикл
		
		ОбластьУслуги = Макет.ПолучитьОбласть("СтрокаТаблицы");			
		ОбластьУслуги.Параметры.НомерСтроки  = ВыборкаУслуги.НомерСтроки;
		ОбластьУслуги.Параметры.Номенклатура = ВыборкаУслуги.НоменклатураПредставление;
		ОбластьУслуги.Параметры.Количество   = ВыборкаУслуги.Количество;
		ОбластьУслуги.Параметры.Цена         = ВыборкаУслуги.Цена;
		ОбластьУслуги.Параметры.Сумма        = ВыборкаУслуги.Сумма;
		ТабДок.Вывести(ОбластьУслуги);
		
	КонецЦикла;
		
	Подвал = Макет.ПолучитьОбласть("Подвал");
		
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета= "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	СуммаПрописью = ЧислоПрописью(Выборка.СуммаДокумента, ФормСтрока, ПарПредмета);
		
	Подвал.Параметры.СуммаПрописью = СуммаПрописью;
	Подвал.Параметры.СуммаДокумета = Выборка.СуммаДокумента;	
	ТабДок.Вывести(Подвал);
		
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 
	ВставлятьРазделительСтраниц = Истина, ОбъектыПечати, Выборка.Ссылка);			
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
 // }}ВКМ_ВашКомпьютерныйМастер, доработка - Юсупов А.Г 09.01.2024 --

 #КонецОбласти

#КонецЕсли
